Repository: 96467840/AspNetCoreComponentLibrary
Catalog: src/AspNetCoreComponentLibrary/Resources/SharedResource.*.resx
Languages: ru

# lang.news
source: News
ru: Новости

# lang.founded
source: Founded: {all}. Shown: {begin}-{end}.
ru: Найдено: {all}. Показано: {begin}-{end}.

# lang.months
source: january,february,march,april,may,june,july,august,september,october,november,december
ru: января,февраля,марта,апрель,мая,июня,июля,августа,сентября,октября,ноября,декабря

# lang.public
source: Published
ru: Опубликовано: {date}

# lang.faq.from
source: {date} from {name}:
ru: {date}. Вопрос от {name}:

# lang.faq.question
source: Question:
ru: Вопрос:

# lang.faq.answer
source: Answer:
ru: Ответ:

# lang.faq.ask
source: Ask your question.
ru: Задать вопрос.

# lang.form.send
source: Send
ru: Отправить

# lang.form.req.fields
source: Fields marked with an asterisk (*) are required.
ru: <![CDATA[Поля, отмеченные звёздочкой (<span class="text-danger required">*</span>), обязательны для заполнения.]]>

# lang.form.req.field
source: Field is required
ru: Поле обязательно для заполнения

# lang.form.field.incorrect
source: Field filled incorrectly.
ru: Поле заполнено неправильно.

# lang.form.fields.wrong
source: Fields {fields} filled incorrectly.
ru: Поля {fields} заполнены неправильно.

# lang.form.field.wrong
source: Field {field} filled incorrectly.
ru: Поле {field} заполнено неправильно.

# lang.form.i.am.not.a.robot
source: I'am not a robot.
ru: Я не робот

# lang.form.send.success
source: Your message was sent succesfully.
ru: Ваше сообщение было успешно отправлено.

# lang.print
source: Print
ru: Распечатать

# lang.shop.buy
source: Buy
ru: Купить

# lang.shop.ordered
source: Ordered
ru: В корзине

# lang.shop.relateditems
source: Related goods
ru: Сопутствующие товары.

# lang.shop.quantity
source: Quantity
ru: Укажите количество

# lang.shop.find
source: Find
ru: Найти

# lang.shop.reset
source: Reset
ru: Очистить

# lang.shop.errorfind
source: An error occurred while retrieving data for your search. Check the connection to the Internet.
ru: Произошла ошибка при получении данных для поиска. Проверьте соединение с интернетом.

# lang.shop.search.text
source: Text
ru: Текст

# lang.shop.search.price
source: Price
ru: Цена

# lang.shop.search.brand
source: Brands
ru: Брэнды

# lang.shop.list
source: List
ru: Список

# lang.shop.gallery
source: Gallery
ru: Галерея

# lang.shop.order.priority
source: Order by default
ru: По умолчанию

# lang.shop.order.name
source: Order by name
ru: По названию

# lang.shop.order.price
source: Order by price
ru: По цене

# lang.shop.order.priority.desc
source: Order by default descending
ru: По умолчанию (по убыванию)

# lang.shop.order.name.desc
source: Order by name descending
ru: По названию (по убыванию)

# lang.shop.order.price.desc
source: Order by price descending
ru: По цене (по убыванию)

# common.delete
source: Delete
ru: Удалить

# common.edit
source: Edit
ru: Изменить

# common.block
source: Block
ru: Скрыть

# common.unblock
source: Unblock
ru: Показать

# common.add
source: Add
ru: Добавить

# common.password
source: Password
ru: Пароль

# common.cancel
source: Cancel
ru: Отменить

# common.save
source: Save
ru: Сохранить

# common.find
source: Find
ru: Найти

# common.reset
source: Reset
ru: Очистить

# common.send
source: Send
ru: Отправить

# common.close
source: Close
ru: Закрыть

# common.more
source: More
ru: Подробнее

# common.select
source: Select
ru: Выбрать

# common.upload
source: Select file
ru: Выбрать файл

# common.hosting
source: Hosted at <a target="_blank" href="https://www.digitalocean.com/?refcode=e5c7b2319d1a">digitalocean.com</a>.
ru: <![CDATA[Размещено на <a target="_blank" href="https://www.digitalocean.com/?refcode=e5c7b2319d1a">хостинге</a>.]]>

# common.made
source: Created by «<a target="_blank" href="http://2garin.com/">Website free</a>»
ru: <![CDATA[Сделано в «<a target="_blank" href="http://2garin.com/">Конструкторе сайтов</a>»]]>

# common.denied
source: Access denied.
ru: Доступ ограничен.

# common.denied.only.author
source: Access denied. Only the author can view this site.
ru: Доступ ограничен. Только автор может просматривать этот сайт.

# common.404
source: Not found.
ru: Страница не найдена.

# common.morefields
source: More options
ru: Больше параметров

# common.lessfields
source: Less options
ru: Меньше параметров

# common.file.deleted
source: File "%file%" removed
ru: Файл {file} удален.

# common.file.deleted.suc
source: File deleted successfully.
ru: Файл удален успешно.

# common.bytes
source: bytes
ru: байт

# common.error.couldnot.create.tmp.folder
source: Can not create a temporary folder.
ru: Не могу создать временную папку.

# common.error.recursion
source: Element can not belong to himself.
ru: Элемент не может находиться сам в себе.

# common.error.recursion.deep
source: Element can not belong to the offspring.
ru: Элемент не может находиться в своем потомке.

# common.error.pwd.chars
source: Field contains invalid characters. Allowed to enter only english letters, digits and special characters: !@#$%^&*()-_=+'"?,.|:;/{}][№`~<>\
ru: <![CDATA[Поле содержит недопустимые символы. Разрешено вводить только английские буквы, цифры и спецсимволы: !@#$%^&*()-_=+'"?,.|:;/{}][№`~<>\]]>

# common.error.len
source: The string has a length of %len%. Maximum allowed: %maxlen%.
ru: Строка имеет длину {len}. Максимально разрешено: {maxlen}.

# common.error.len.lang
source: The string (language: %lang%) has a length of %len%. Maximum allowed: %maxlen%.
ru: Строка (язык: {lang}) имеет длину {len}. Максимально разрешено: {maxlen}.

# common.error.date.format
source: Wrong date format. The correct format: %format%
ru: Неправильный формат даты. Правильный формат: {format}

# common.error.date.not.exists
source: Date does not exist.
ru: Дата не существует.

# common.error.date.hour
source: Field contains invalid value "hours"
ru: Поле содержит недопустимое значение "часы"

# common.error.date.minute
source: Field contains invalid value "minutes"
ru: Поле содержит недопустимое значение "минуты"

# common.error.date.second
source: Field contains invalid value "seconds"
ru: Поле содержит недопустимое значение "секунды"

# common.unique
source: Value must be unique.
ru: Значение должно быть уникальным.

# common.save.error
source: Save error. Please try again later.
ru: Ошибка при сохранении. Пожалуйста повторите попытку позже.

# common.send.error
source: Send mail error. Please try again later.
ru: Ошибка при отправке почты. Пожалуйста повторите попытку позже.

# common.file.delete
source: Delete file.
ru: Удаление файла.

# common.file.delete.confirm
source: Delete file? Recovery will be impossible!<br/><br/>Are you sure?
ru: Удалить файл? Восстановление будет невозможно.

# common.image.name
source: Name
ru: Название

# common.image.priority
source: Priority
ru: Порядковый номер

# common.select.value
source: Select value ...
ru: Выберите значение ...

# common.items.saved
source: Items has been saved successfully
ru: Элементы сохранены успешно

# common.items.error.saving
source: Error saving data
ru: Ошибка при сохранении данных

# common.articul
source: Articul
ru: Артикул

# menus.name
source: Pages!
ru: Страницы

# sites.name
source: Sites!
ru: Сайты

# languages.name
source: Languages!
ru: Языки
